---
kind: property
id: P:Autodesk.Revit.DB.Reference.ElementReferenceType
source: html/195bc15b-094a-51d3-e368-35c5f7a3599b.htm
---
# Autodesk.Revit.DB.Reference.ElementReferenceType Property

The type of reference.

## Syntax (C#)
```csharp
public ElementReferenceType ElementReferenceType { get; }
```